Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: Next, try to make each commit a logically separate changeset.
es: En segundo lugar, intentar hacer de cada confirmación (commit) un grupo lógico e independiente de cambios.

source: you put this script:
es: un script tal como:

source: Throughout this book, you’ve used simple mappings from remote branches to local references; but they can be more complex.
es: A lo largo del libro has utilizado sencillos mapeados entre ramas remotas y referencias locales; pero las cosas pueden ser bastante más complejas.

source: You can see GitWeb in use at sites like `http://git.kernel.org` (see Figure 4-1).
es: Puedes ver a GitWeb en acción en sitios como `http://git.kernel.org` (ver figura 4-1)

source: It’s also possible to take a series of commits and squash them down into a single commit with the interactive rebasing tool.
es: Con la herramienta de reorganización interactiva, es posible recombinar una serie de confirmaciones de cambio y agruparlas todas en una sola.

source: To get the raw commit data, you can use another plumbing command called `git cat-file`.
es: Para obtener los datos "en crudo" de una confirmación de cambios, puedes utilizar otro comando de mantenimiento de Git denominado 'git cat-file'.

source: Many groups switch to Git because of this ability to have multiple teams working in parallel, merging the different lines of work late in the process.
es: Muchos grupos se están pasando a trabajar con Git, debido a su habilidad para mantener multiples equipos trabajando en paralelo, fusionando posteriormente las diferentes líneas de trabajo.

source: In addition to the client-side hooks, you can use a couple of important server-side hooks as a system administrator to enforce nearly any kind of policy for your project.
es: Aparte de los puntos del lado cliente, como administrador de sistemas, puedes utilizar un par de puntos de enganche importantes en el lado servidor; para implementar prácticamente cualquier tipo de política que quieras mantener en tu proyecto.

source: For example, you can start a branch named `recover-branch` at that commit (ab1afef):
es: Por ejemplo, puedes iniciar una rama llamada `recover-branch` con dicha confirmación de cambios (ab1afef):

source: ## Debugging with Git ##
es: ## Depuración con Git ##

source: All you have to do is check out the branch you wish to merge into and then run the `git merge` command:
es: Simplemente, activando (checkout) la rama donde deseas fusionar y lanzando el comando 'git merge':

source: Remote references differ from branches (`refs/heads` references) mainly in that they can’t be checked out.
es: Las referencias remotas son distintas de las ramas normales, (referencias en `refs/heads`); y no se pueden recuperar (checkout) al espacio de trabajo.

source: These three main Git objects — the blob, the tree, and the commit — are initially stored as separate files in your `.git/objects` directory.
es: Estos tres objetos Git, -binario, árbol y confirmación de cambios--, se guardan como archivos separados en la carpeta `.git/objects`.

source: To see the diff of what you’ve staged, you can use the `6` or `d` (for diff) command.
es: Para ver las diferencis entre lo que está preparado, se puede utilizar la opción '6' o 'd' (diff).

source: You can create an account, add a new project, and push to it in a matter of minutes.
es: Puedes crear una cuenta, añadir un nuevo proyecto y contribuir a él en cuestión de minutos.

source: ### Topic Branches ###
es: ### Ramas puntuales ###

source: After you run a successful `git checkout`, the `post-checkout` hook runs; you can use it to set up your working directory properly for your project environment.
es: Tras completarse la ejecución de un comando 'git checkout', es cuando se activa el punto de enganche 'post-checkout. Lo puedes utilizar para ajustar tu carpeta de trabajo al entorno de tu proyecto.

source: You’re looking for a pair of files named something and something.pub, where the something is usually `id_dsa` or `id_rsa`.
es: Has de buscar un par de archivos con nombres tales como 'algo' y 'algo.pub'; siendo ese "algo" normalmente 'id_dsa' o 'id_rsa'.

source: Insert 18333fig0310.png Figure 3-10.
es: Insert 18333fig0310.png Figura 3-10.

source: The next time one of your collaborators fetches from the server, they will get a reference to where the server’s version of `serverfix` is under the remote branch `origin/serverfix`:
es: La próxima vez que tus colaboradores recuperen desde el servidor, obtendrán una referencia a donde la versión de 'serverfix' en el servidor esté bajo la rama remota 'origin/serverfix':

source: At this point, you can determine what you’d like to do with it.
es: Tienes que decidir lo que deseas hacer con él.

source: ### The HEAD ###
es: ### La CABEZA (HEAD) ###

source: How many users are actively contributing code to this project, and how often?
es: ¿Cuántos usuarios están enviando activamente código a este proyecto?, y ¿con qué frecuencia?.

source: Because the refspec is `<src>:<dst>`, by leaving off the `<src>` part, this basically says to make the topic branch on the remote nothing, which deletes it.
es: Se elimina la rama 'topic' del servidor remoto, ya que la sustituimos or nada. (Al ser la referencia `<origen>:<destino>`, si no indicamos la parte `<origen>`, realmente estamos diciendo que enviamos 'nada' a `<destino>`.)

source: What is cool is that although the objects on disk before you ran the `gc` were collectively about 12K in size, the new packfile is only 6K.
es: Lo que es interesante es el hecho de que, aunque los objetos originales presentes en el disco antes del `gc` ocupaban unos 12 Kbytes, el nuevo archivo empaquetador apenas ocupa 6 Kbytes.

source: You can run tests or otherwise inspect the working tree with this script.
es: Con este script, puedes lanzar pruebas o similares para chequear el arbol de trabajo.

source: This option isn’t on by default because it doesn’t work if the commit the patch says it was based on isn’t in your repository.
es: Esta opción no se usa por defecto, porque no funcionará en caso de que la confirmación de cambios en que el parche dice estar basado no esté presente en tu repositorio.

source: You can have Git tell you the object type of any object in Git, given its SHA-1 key, with `cat-file -t`:
es: Con la orden 'cat-file -t' puedes comprobar el tipo de cualquier objeto almacenado en Git, sin mas que indicar su clave SHA-1':

source: Adding a collaborator to your project.
es: Añadirendo un colaborador a tu proyecto.

source: Suppose you look at the history of your project:
es: Suponiendo que sea esta la historia de un proyecto:

source: Someone accidentally commits a huge binary file with a thoughtless `git add .`, and you want to remove it everywhere.
es: Alguien confirma cambios y almacena accidentalmente un enorme archivo binario cuando lanza un `git add .` sin pensarlo demasiado. Y es necesario quitarlo del repositorio.

source: There are also more interesting ways to do this on a per-user basis via ACLs, as you’ll learn at the end of this chapter.
es: Existen también algunas otras maneras más interesantes de hacer esto mismo, pero para usuarios concretos, a través de permisos (ACLs); tal y como veremos al final de este capítulo.

source: The negative aspect of SSH is that you can’t serve anonymous access of your repository over it.
es: El aspecto negativo de SSH es su imposibilidad para dar acceso anónimo al repositorio.

source: That’s it — you’ve created a valid Git blob object.
es: Y ¡esto es todo!. --acabas de crear un auténtico objeto Git binario grande (blob)--.

source: You need to find the latest commit SHA and then add a branch that points to it.
es: Necesitas localizar el SHA de la última confirmación de cambios y luego añadir una rama que apunte hacia ella.

source: Example history before a cherry pick.
es: Historial de ejemplo, antes de entresacar.

source: Your file contains a section that looks something like this:
es: El archivo conflictivo contendrá algo como:

source: Insert 18333fig0509.png Figure 5-9.
es: Insert 18333fig0509.png Figura 5-9.

source: The packed repository size is down to 7K, which is much better than 2MB.
es: El tamaño del repositorio ahora es de 7 KB, mucho mejor que los 2 MB anteriores.

source: If you have no interest in running your own server, you can skip to the last section of the chapter to see some options for setting up a hosted account and then move on to the next chapter, where we discuss the various ins and outs of working in a distributed source control environment.
es: Si este es el caso, si no tienes interés de tener tu propio servidor, puedes saltar directamente a la última sección del capítulo; donde verás algunas opciones para dar de alta una cuenta albergada. Y después puedes moverte al capítulo siguiente, donde vamos a discutir algunos de los mecanismos para trabajar en un entorno distribuido.

source: To be clear, Git isn’t tied into any particular issue-tracking system; but because issue #53 is a focused topic that you want to work on, you’ll create a new branch in which to work.
es: Aunque, por supuesto, Git no está ligado a ningún sistema de seguimiento de problemas concreto. Como el problema #53 es un tema concreto y puntual en el que vas a trabajar, creas una nueva rama para él.

source: You can also initiate the process via the Git daemon, which listens on a server on port 9418 by default.
es: O se puede arrancar a traves del demonio Git, que suele estar escuchando por el puerto 9418.

source: To apply a patch generated by `format-patch`, you use `git am`.
es: Para incorporar un parche generado con 'format-patch', utilizarás el comando 'git am'.

source: It keeps a special pointer called HEAD.
es: Pues...., mediante un apuntador especial denominado HEAD.

source: Git stores content in a manner similar to a UNIX filesystem, but a bit simplified.
es: Git guarda contenido de manera similar a un sistema de archivos UNIX, pero de forma algo más simple.

source: A list of collaborators on your project.
es: Lista de colaboradores en tu proyecto.

source: Multiple branches pointing into the commit’s data history.
es: Apuntadores de varias ramas en el registro de confirmaciones de cambio.

source: At this point, the others can clone it down and push changes back up just as easily:
es: Tras lo cual, otros podrán clonarlo y enviar cambios de vuelta:

source: The third column in the output is the size of the object in the pack, so you can see that `05408` takes up 12K of the file but that `9bc1d` only takes up 7 bytes.
es: La tercera columna refleja el tamaño de cada objeto dentro del paquete. Observandose que `05408` ocupa unos 12 Kbytes; pero `9bc1d` solo ocupa 7 bytes.

source: Insert 18333fig0307.png Figure 3-7.
es: Insert 18333fig0307.png Figura 3-7.

source: All the objects in your Git directory.
es: Todos los objetos en tu carpeta Git.

source: As an extra precaution, you can easily restrict the 'git' user to only doing Git activities with a limited shell tool called `git-shell` that comes with Git.
es: Para una mayor protección, puedes restringir facilmente el usuario 'git' a realizar solamente actividades relacionadas con Git. Utilizando un shell limitado llamado 'git-shell', que viene incluido en Git.

source: For instance, if a documentation author tries to push a commit modifying something in the `lib` directory, they see
es: Por ejemplo, si un editor técnico intenta enviar una confirmación de cambios donde se haya modificado algo de la carpeta 'lib', verá:

source: From now on, as long as that `update` script is there and executable, your repository will never be rewound and will never have a commit message without your pattern in it, and your users will be sandboxed.
es: De ahora en adelante, en tanto en cuando el script 'update' este presente y sea ejecutable, tu repositorio nunca se verá perjudicado, nunca tendrá un mensaje de confirmación de cambios sin tu plantilla y tus usuarios estarán controlados.

source: First, you see this where the hook starts running.
es: Lo primero observado cuando el enganche (hook) arranca es:

source: You created and switched to a branch, did some work on it, and then switched back to your main branch and did other work.
es: Has creado una rama y saltado a ella, has trabajado sobre ella; has vuelto a la rama original, y has trabajado también sobre ella.

source: To visualize this, let’s assume that you have a directory containing three files, and you stage them all and commit.
es: Para ilustrar esto, vamos a suponer, por ejemplo, que tienes una carpeta con tres archivos, que preparas (stage) todos ellos y los confirmas (commit).

source: When you run `git archive`, the contents of that file when people open the archive file will look like this:
es: Cuando lances la orden 'git archive', lo que la gente verá en ese archivo cuando lo abra será:

source: If your `master` branch has moved forward since you created the topic branch from it, then you’ll get seemingly strange results.
es: Si tu rama 'master' ha avanzado con respecto al momento en que se creó la rama puntual a partir de ella, puedes obtener resultados realmente extraños.

source: If you track down a bug in your code and want to know when it was introduced and why, file annotation is often your best tool.
es: Cuando se está rastreando un error dentro del código buscando localizar cuándo se introdujo y por qué, el mejor auxiliar para hacerlo es la anotación de archivos.

source: When you design these filters, they should be able to fail gracefully and have the project still work properly.
es: Cuando diseñes este tipo de filtros, han de estar pensados para que el proyecto continue funcionando correctamente incluso cuando fallen.

source: That is all a lightweight tag is — a branch that never moves.
es: Una etiqueta ligera es simplemente eso: una rama que nunca se mueve.

source: When you have work in a topic branch that you’ve done or that someone has contributed and you’ve verified, you merge it into your master branch, delete the topic branch, and then continue the process.
es: Cuando en una rama puntual tienes trabajo ya terminado o contribuciones ya verificadas de terceros, los fusionas en tu rama 'master', borras la rama puntual, y continuas trabajando en otra/s rama/s.

source: You can do this by listing them with the `bisect start` command if you want, listing the known bad commit first and the known good commit second:
es: Se puede hacer en un solo paso. Indicando ambas confirmaciones de cambios al comando `bisect start`, primero la mala y luego la buena:

source: For instance, some text files may be machine generated and not diffable, whereas some binary files can be diffed — you’ll see how to tell Git which is which.
es: Por ejemplo, algunos archivos de texto se generan automáticamente y no tiene sentido compararlos; mientras que algunos archivos binarios sí que pueden ser comparados --vamos a ver cómo indicar a Git cual es cual--.

source: You can also not specify a user, and Git assumes the user you’re currently logged in as.
es: Pudiendo asimismo prescindir del usuario; en cuyo caso Git asume el usuario con el que estés conectado en ese momento.

source: Do some work in that branch.
es: Realizas algo de trabajo en esa rama.

source: It shows you that a couple of lines are staged and a couple are unstaged.
es: Muestra que un par de líneas han sido preparadas (staged) en el área de preparación y otro par han sido dejadas fuera de dicho área (unstaged).

source: One of the great things about Git is that it allows you to make decisions at the last possible moment.
es: Una de las grandes caracteristicas de Git es su capacidad de postponer las decisiones hasta el último momento.

source: Then, they commit a pointer to that non-public state and push up the superproject.
es: Pero, sin embargo, sí que confirma (commit) y envia (push) un puntero a dicho estado dentro del proyecto padre.

source: You run your test again and find that this commit is broken, so you tell Git that with `git bisect bad`:
es: De nuevo, se pueden lanzar las pruebas para ver si el problema existe o no en ese punto. Si, por ejemplo, si existiera se indicaría ese hecho a Git tecleando `git bisect bad`:

source: They’re all equivalent, because Git expands each of them to `refs/remotes/origin/master`.
es: Todas estas sentencias son equivalentes, ya que Git expande cada una de ellas a `refs/remotes/origin/master`.

source: Often, when you’ve been working on part of your project, things are in a messy state and you want to switch branches for a bit to work on something else.
es: Según se está trabajando en un apartado de un proyecto, normalmente el espacio de trabajo suele estar en un estado inconsistente. Pero puede que se necesite cambiar de rama durante un breve tiempo para ponerse a trabajar en algún otro tema urgente.

source: If you want to apply one of the older stashes, you can specify it by naming it, like this: `git stash apply stash@{2}`.
es: Si lo que se desea es reaplicar alguno de los grupos más antiguos de cambios, se ha de indicar expresamente: `git stash apply stash@{2}`

source: This workflow is attractive to a lot of people because it’s a paradigm that many are familiar and comfortable with.
es: Esta forma de trabajar es atractiva para mucha gente, por ser el paradigma con el que están familiarizados y se sienten confortables.

source: To give another user write access to your project, click the “Add another collaborator” link.
es: Para dar acceso de escritura a otro usuario, clica sobre el enlace "Add another collaborator".

source: Let’s see how much space you saved.
es: Y ahora, vamos a ver cuanto espacio hemos ahorrado.

source: The `gitosis.conf` file is the control file you use to specify users, repositories, and permissions.
es: El archivo 'gitosis.conf' es el archivo de control que usarás para especificar usuarios, repositorios y permisos.

source: To demonstrate, you’ll go into your project and start working on a couple of files and possibly stage one of the changes.
es: Por ejemplo, si se está trabajando sobre un par de archivos e incluso uno de ellos está ya añadido al área de preparación para un futuro almacenamiento de sus cambios en el repositorio.

source: ### Pushing Refspecs ###
es: ### Enviando (push) referencias ###

source: Insert 18333fig0503.png Figure 5-3.
es: Insert 18333fig0503.png Figura 5-3.

source: She can merge either `origin/master` or `issue54` first — they’re both upstream, so the order doesn’t matter.
es: Puede fusionar primero tanto 'origin/master' o como 'issue54', ya que ambos están aguas arriba.

source: You have to merge that work in at some point so you can keep up with the other developer in the future.
es: Te ves obligado a fusionar (merge) ese trabajo en algún punto, para poder seguir adelante con otros desarrollos en el futuro.

source: This is how Git stores the content initially — as a single file per piece of content, named with the SHA-1 checksum of the content and its header.
es: En principio, esta es la forma en que guarda Git los contenidos; como un archivo por cada pieza de contenido, nombrado con la suma de comprobación SHA-1 del contenido y su cabecera.

source: A single tree object contains one or more tree entries, each of which contains a SHA-1 pointer to a blob or subtree with its associated mode, type, and filename.
es: Un objeto tipo árbol tiene una o más entradas de tipo arbol. Y cada una de ellas consta de un puntero SHA-1 a un objeto binario (blob) o a un subárbol, más sus correspondientes datos de modo, tipo y nombre de archivo.

source: You have to move the `rack` submodule directory out of the way before you can switch to a branch that doesn’t have it:
es: Antes de cambiar a cualquier rama que no lo contenga, es necesario quitar de enmedio la carpeta del submódulo 'rack'.

source: It contains tabs to different aspects of your projects.
es: Tiene pestañas que llevan a distintos aspectos del proyecto.

source: Each of the three commit objects points to one of the three snapshot trees you created.
es: Cada uno de estos tres objetos de confirmación de cambios apunta a uno de los tres objetos tipo árbol que habias creado previamente.

source: Simply set up a single repository, and give everyone on your team push access; Git won’t let users overwrite each other.
es: Solo necesitas disponer un repositorio único, y dar acceso en envio (push) a todo tu equipo. Git se encargará de evitar el que se sobreescriban unos a otros.

source: Now your users can’t push any commits with badly formed messages or with modified files outside of their designated paths.
es: Una vez implementado todo esto, tus usuarios no podrán enviar confirmaciones de cambios con mensajes mal formados o con modificaciones sobre archivos fuera de las ubicaciones que les hayas designado.

source: You solve this issue much the same way — edit the file to resolve the conflict, stage the new file, and then run `git am --resolved` to continue to the next patch:
es: Y resolverás los problemas de la misma manera: editar el archivo para resolver los conflictos, prepararlo (stage), y lanzar 'git am --resolved' para continuar con el siguiente parche:

source: SSH is also the only network-based protocol that you can easily read from and write to.
es: Por otro lado, SSH es el único protocolo de red con el que puedes facilmente tanto leer como escribir.

source: Because your starting point is the `ca82a6` commit object you saw in the `info/refs` file, you start by fetching that:
es: En el archivo `info/refs` se ve que el punto de partida es la confirmación de cambios (commit) `ca82a6`, y, por tanto, comenzaremos recuperandola:

source: To allow read access to your repository over HTTP, do something like this:
es: Para permitir acceso a tu repositorio a través de HTTP, puedes hacer algo como esto:

source: You have to see who last changed the submodule:
es: Forzandonos a mirar quién ha sido la persona que ha realizado los últimos cambios en el submódulo:

source: Your branch will contain only work from that commit down:
es: Y la rama contendrá únicamente trabajo desde esa confirmación de cambios hacia atrás.

source: Oddly enough, you have a real Git history now that you can view with the `git log` command, if you run it on the last commit SHA-1:
es: Más aún, en estos momentos tienes ya un verdadero historial Git. Lo puedes comprobar con el comando `git log`. Lanzandolo mientras estás en la última de las confirmaciones de cambio.

source: The `size-pack` entry is the size of your packfiles in kilobytes, so you’re using 2MB.
es: El valor de `size-pack` nos da el tamaño de tus archivos empaquetadores, en kilobytes, y, por lo que se ve, estás usando 2 MB.

source: Now your history looks like Figure 5-27.
es: Tu historial quedará tal como ilustra la Figura 5-27.

source: The next sections will explain some typical setups using those protocols and how to get your server running with them.
es: Las siguientes secciones explicarán algunas de las típicas configuraciones utilizando esos protocolos, y cómo podemos poner en marcha nuestro servidor con ellos.

source: The core.pager setting determines what pager is used when Git pages output such as `log` and `diff`.
es: El parámetro core.pager selecciona el paginador utilizado por Git cuando muestra resultados de comandos tales como 'log' o 'diff'.

source: The upside of using the HTTP protocol is that it’s easy to set up.
es: La mejor parte del protocolo HTTP es su sencillez de preparación.

source: She can then fetch Josie’s changes down with `git fetch`:
es: Por tanto, recupera (fetch) los cambios de Josie:

source: ### Starting with Submodules ###
es: ### Trabajando con submódulos ###
